# Módulo 2 Ejercicio 4

**1. Continuaremos trabajando con nuestros datos de supermercado.  Para esto cargaremos los 4 archivos (clientes, boletas, detalle y productos) y responderemos a las siguientes preguntas:** s:

*a. Generar un DataFrame con cada archivo*

In [ ]:
# Importamos librería Pandas
import pandas as pd

# Cargamos la información en una variable y luego las transformamos a DataFrame
clientes = pd.read_csv('clientes.csv', encoding='latin1')
boletas = pd.read_csv('boletas.csv', encoding='latin1')
detalle = pd.read_csv('detalle.csv', encoding='latin1')
productos = pd.read_csv('productos.csv', encoding='latin1')

df_clientes = pd.DataFrame(clientes)
df_boletas = pd.DataFrame(boletas)
df_detalle  = pd.DataFrame(detalle)
df_productos = pd.DataFrame(productos)

In [ ]:
# Desplegamos en pantalla el df_clientes
df_clientes

In [ ]:
# Desplegamos en pantalla el df_boletas
df_boletas

In [ ]:
# Desplegamos en pantalla el df_detalle
df_detalle

In [ ]:
# Desplegamos en pantalla el df_productos
df_productos

*b. ¿Cuántos datos tiene cada DataFrame?*

In [ ]:
# Creamos mensaje de impresión que incluye código para obtener la cantidad de elementos de cada DataFrame
print('La cantidad de datos en el DataFrame clientes es', df_clientes.size)
print('La cantidad de datos en el DataFrame boletas es', df_boletas.size)
print('La cantidad de datos en el DataFrame detalle es', df_detalle.size)
print('La cantidad de datos en el DataFrame productos es', df_productos.size)

*c. ¿Cuántos clientes no tienen mail?*

In [ ]:
# Creamos una variable para obtener la cantidad de datos faltantes en la columna mail del DataFrame clientes
valores_nan_df_clientes = df_clientes['email'].isna().sum()

#  Mostramos el resultado por pantalla
print('La cantidad de clientes que no tienen registrado su mail en la base de datos es:', valores_nan_df_clientes)

*d. Genera un filtro para saber a qué clientes les falta un dato (cualquiera)*

In [ ]:
# Creamos un filtro para obtener las filas del df_clientes que tienen al menos una entrada faltante
clientes_info_incompleta = df_clientes.isna().any(axis=1)

# Usamos el df_cilentes_info_incompleta para filtrar la información y obtener el nombre de los  clientes con información incompleta
clientes_falta_data =  df_clientes[df_clientes_info_incompleta]

#Desplegamos en pantalla  los clientes con información incompleta
print('A los clientes que al menos le falta  alguna entrada de datos son:')
df_clientes_falta_data = pd.DataFrame(clientes_falta_data)
df_clientes_falta_data['nombre']

*e. ¿A cuantos clientes les faltan datos?*

In [ ]:
# Configuramos el mensaje para informar la cantidad de clientes con datos faltantes mediante el método .shape[] para contar la cantidad de columnas del df
print('La cantidad de clientes a los que le falta, al menos, un dato es', df_clientes_falta_data.shape[0])

*f. Agregar una nueva columna a todos los clientes, que indique si le falta algún dato o no (con un mapeo)*

In [ ]:
# Agregamos una nueva columna con el estado de la información usando el filtro clientes_info_incompleta y método .map() para configurar la información de la columna
df_clientes['info_completa'] = clientes_info_incompleta.map({True: 'Falta Información', False: 'Información Completa'})

# Despliega en pantalla el df_clientes con la nueva información agregada
df_clientes

*g. A todos los clientes que les falten datos, deben rellenarse con un S/I, excepto la fecha de nacimiento*

In [ ]:
# Creamos una variable que nos permita identificar las columnas que no se deben rellenar con método columns.difference()
columnas_a_rellenar = df_clientes.columns.difference(['fecha_nacimiento'])

# Usamos el método .fillna() para rellenar el df_clientes reemplazando NaN por 'S/I'"Nueva carpeta"
df_clientes[columnas_a_rellenar] = df_clientes[columnas_a_rellenar].fillna('S/I')

# Desplegamos el df_clientes actualizado con la nueva información
df_clientes

*h. Busque en los productos si existe algún outlier*

In [ ]:
# Calculamos el rango intercuartil (IQR) para la columna de precios
Q1 = df_productos['precio'].quantile(0.25)
Q3 = df_productos['precio'].quantile(0.75)
IQR = Q3 - Q1

# Definimos los límites inferior y superior basados en el IQR
limite_inferior = Q1 - 1.5 * IQR
limite_superior = Q3 + 1.5 * IQR

# Filtra y segrega los productos outliers del DataFrame
productos_outliers = df_productos[(df_productos['precio'] < limite_inferior) | (df_productos['precio'] > limite_superior)]

print('Los productos outlier en el df_productos son:')
print(productos_outliers)

**2. El archivo “M3E4 - titanic.csv” contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos:**

*a. Generar un DataFrame con los datos del fichero*

In [ ]:
# Importamos librería pandas
import pandas as pd

# Cargamos los datos del archivo titanic.csv y lo convertimos a un dataFrame
titanic = pd.read_csv('Titanic.csv')

df_titanic = pd.DataFrame(titanic)

df_titanic

*b. Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene, los nombres de sus columnas y filas, los tipos de datos de las columnas, las primeras 10 filas y las 10 últimas filas*

In [ ]:
dimensiones_df = list(df_titanic.shape)
q_datos_en_df = df_titanic.size
df_nombre_columnas = pd.DataFrame(df_titanic)
nombre_columnas_df = df_nombre_columnas.columns.tolist()
nombre_filas_df = df_titanic.index.tolist()

print(f'- Las dimensiones del DataFrame Titanic es de {dimensiones_df[0]} filas por {dimensiones_df[1]} columnas')
print('')
print(f'- El DataFrame Titanic contiene {q_datos_en_df} datos')
print('')
print('Los nombres de las columnas del DataFrame Titanic son:')
print('-' * 50)
for i in nombre_columnas_df:
    print(i)
print('')
print('-' * 50)
print('- El nombre de las filas del DatFrame Titanic son:')
for i in nombre_filas_df:
    print(i, end=', ')

In [ ]:
print('- Las primeras 10 filas del DataFrame Titanic son:')
df_titanic.head(10)

In [ ]:
print('- Las últimas 10 filas del DataFrame Titanic son:')
df_titanic.tail(10)

*c. Mostrar por pantalla los datos del pasajero con identificador 148.*

In [48]:
identificador148 = df_titanic.iloc[148]
df_identificador148 = pd.DataFrame(identificador148)
print('- Los datos del pasajero con índice 148 son:')
print('-' * 55)
df_identificador148

- Los datos del pasajero con índice 148 son:
-------------------------------------------------------

                                                  148
PassengerId                                       149
Survived                                            0
Pclass                                              2
Name         Navratil, Mr. Michel ("Louis M Hoffman")
Sex                                              male
Age                                              36.5
SibSp                                               0
Parch                                               2
Ticket                                         230080
Fare                                             26.0
Cabin                                              F2
Embarked                                            S

In [46]:
passengerId148 = df_titanic.loc[df_titanic['PassengerId'] == 148]
df_passengerId148 = pd.DataFrame(passengerId148)
print('- Los datos del pasajero de PassengerId 148 son:')
print('-' * 55)
df_passengerId148

- Los datos del pasajero con identificador 148 son:
-------------------------------------------------------

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
147,148,0,3,"Ford, Miss. Robina Maggie ""Ruby""",female,9.0,2,2,W./C. 6608,34.375,NaN,S

*d. Mostrar por pantalla las filas pares del DataFrame*

In [ ]:
df_titanic_filas_indice_par = df_titanic.iloc[::2]

print('- Las filas par del DataFrame (por índice) son:')
print('- '* 50)

df_titanic_filas_indice_par

In [ ]:
df_titanic_filas_par_por_posicion = df_titanic.iloc[1::2]

print('- Las filas par del DataFrame (por posición) son:')
print('- '* 50)

df_titanic_filas_par_por_posicion

*e. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente*

In [50]:
df_1_clase = df_titanic['Pclass'] == 1
df_pclass_1 =  df_titanic[df_1_clase]

df_nombre_pclass_alfa = df_pclass_1['Name']
df_nombre_pclass_alfa_ordenado = df_nombre_pclass_alfa.sort_values()
df_titanic_nombre_pclass_alfa_ordenado = pd.DataFrame(df_nombre_pclass_alfa_ordenado)
df_titanic_nombre_pclass_alfa_ordenado

                                                Name
730                    Allen, Miss. Elisabeth Walton
305                   Allison, Master. Hudson Trevor
297                     Allison, Miss. Helen Loraine
498  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
460                              Anderson, Mr. Harry
..                                               ...
155                      Williams, Mr. Charles Duane
351           Williams-Lambert, Mr. Fletcher Fellows
55                                 Woolner, Mr. Hugh
555                               Wright, Mr. George
325                         Young, Miss. Marie Grice

[216 rows x 1 columns]

*f. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron*

In [60]:
df_survived = df_titanic['Survived'] == 1
df_titanic_survived =  df_titanic[df_survived]
number_survided = df_titanic_survived.shape[0]
number_died = df_titanic.shape[0]  - number_survided
survived_porcentaje = round((number_survided / df_titanic.shape[0] * 100), 2)
died_porcentaje = 100 - survived_porcentaje

print(f'- La cantidad de personas que sobrevieron en Titanic es {number_survided} que equivale al {survived_porcentaje}%.  La cantidad de personas que murieron es {number_died} que equivale al {died_porcentaje}%')

- La cantidad de personsa que sobrevieron en Titanic es 342 que equivale al 38.38%.  La cantidad de personas que murieron es 549 que equivale al 61.62%

*g. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase*

In [88]:
clases_en_titanic = df_titanic_survived['Pclass'].unique().tolist()
clases_ordenadas = sorted(clases_en_titanic)
total_tipo_clases = len(clases_ordenadas)

# ------------------------------------------------------------------------

clase1_total = df_titanic[df_titanic.Pclass == 1]['PassengerId'].count()
clase2_total = df_titanic[df_titanic.Pclass == 2]['PassengerId'].count()
clase3_total = df_titanic[df_titanic.Pclass == 3]['PassengerId'].count()

total_x_clase = [clase1_total, clase2_total, clase3_total]

# -----------------------------------------------------------------------

clase1_survived = df_titanic[df_titanic.Pclass == 1]['Survived'].sum()
clase2_survived = df_titanic[df_titanic.Pclass == 2]['Survived'].sum()
clase3_survived = df_titanic[df_titanic.Pclass ==  3]['Survived'].sum()

total_sob_x_clase = [clase1_survived, clase2_survived, clase3_survived]

# -------------------------------------------------------------------------

clase1_died = clase1_total - clase1_survived
clase2_died = clase2_total - clase2_survived
clase3_died = clase3_total - clase3_survived

total_muer_x_clase = [clase1_died, clase2_died, clase3_died]

# ---------------------------------------------------------------------

perc_clase1_surv_por_clase =  round((clase1_survived / clase1_total) * 100, 2)
perc_clase2_surv_por_clase = round((clase2_survived / clase2_total) * 100, 2)
perc_clase3_surv_por_clase = round((clase3_survived / clase3_total) * 100, 2)

porcen_sobr_x_clase = [perc_clase1_surv_por_clase, perc_clase2_surv_por_clase, perc_clase3_surv_por_clase]

# ---------------------------------------------------------------------------

perc_clase1_died_por_clase = 100 - perc_clase1_surv_por_clase
perc_clase2_died_por_clase = 100 - perc_clase2_surv_por_clase
perc_clase3_died_por_clase = 100 - perc_clase3_surv_por_clase

porcen_muer_x_clase = [perc_clase1_died_por_clase, perc_clase2_died_por_clase, perc_clase3_died_por_clase]
# -----------------------------------------------------------------------

perc_clase1_surv_sobre_total = round((perc_clase1_surv_por_clase / df_titanic.shape[0]) * 100, 2)
perc_clase2_surv_sobre_total = round((perc_clase2_surv_por_clase / df_titanic.shape[0]) * 100, 2)
perc_clase3_surv_sobre_total = round((perc_clase3_surv_por_clase / df_titanic.shape[0]) * 100, 2)

porcen_sobr_sobre_total = [perc_clase1_surv_sobre_total, perc_clase2_surv_sobre_total, perc_clase3_surv_sobre_total]

# -------------------------------------------------------------------------------

perc_clase1_died_sobre_total = 100 - perc_clase1_surv_sobre_total
perc_clase2_died_sobre_total = 100 - perc_clase2_surv_sobre_total
perc_clase3_died_sobre_total = 100 - perc_clase3_surv_sobre_total

porc_muer_sobre_total = [perc_clase1_died_sobre_total, perc_clase2_died_sobre_total, perc_clase3_died_sobre_total]


# --------------------------------------------------------------------------

datos_surv_died_titanic = {'Clase' : clases_ordenadas, 'Total Pasajeros' : total_x_clase, 'Sobrevivieron' : total_sob_x_clase, 'Murieron' : total_muer_x_clase,
                           '% Sobre sobre Clase': porcen_sobr_x_clase, '% Muertos sobre Clase' : porcen_muer_x_clase, '% Survived sobre Total' : porcen_sobr_sobre_total, '% Muertos sobre Total' : porc_muer_sobre_total}

df_supervivientes = pd.DataFrame(datos_surv_died_titanic)


df_supervivientes

,Clase,Total Pasajeros,Sobrevivieron,Murieron,% Sobre sobre Clase,% Muertos sobre Clase,% Survived sobre Total,% Muertos sobre Total
0,1,216,136,80,62.96,37.04,7.07,92.93
1,2,184,87,97,47.28,52.72,5.31,94.69
2,3,491,119,372,24.24,75.76,2.72,97.28

In [42]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

1

In [68]:
import pandas as pd

# Crear un DataFrame de ejemplo
data = {
    'A': [1, 3, 2, 3, 1, 2],
    'B': ['a', 'b', 'c', 'a', 'b', 'c'],
    'C': [1.1, 2.2, 3.3, 1.1, 2.2, 3.2]
}

df = pd.DataFrame(data)

# Elegir la columna específica
columna_especifica = 'A'

# Identificar los valores numéricos únicos en la columna específica
valores_unicos_columna = df[columna_especifica].unique()
valores_numericos_unicos = [v for v in valores_unicos_columna if pd.api.types.is_number(v)]

print(f"Valores numéricos únicos en la columna {columna_especifica}: {valores_numericos_unicos}")

Valores numéricos únicos en la columna A: [1, 3, 2]